app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs"
---
  def index
    @blogs = Blog.all.reverse

INSERT INTO "blogs" ("category", "blogEntry", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @blog = Blog.new(blog_params)

    if @blog.save

UPDATE "blogs" SET "category" = $1, "blogEntry" = $2, "author" = $3, "updated_at" = $4 WHERE "blogs"."id" = $5  [["category", ""], ["blogEntry", ""], ["author", ""], ["updated_at", "2019-12-16 15:22:14.116413"], ["id", 6]]
---
  def update
    if @blog.update(blog_params)